---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNoAttachedParentWarn
source: html/1a7a5434-600b-9921-1ba0-bab9d90061f0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNoAttachedParentWarn Property

Attached Detail Group can't be copied without its Model Group

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyNoAttachedParentWarn { get; }
```